let handler = async (m, { conn, usedPrefix, usedPrefix: _p, __dirname, text, isPrems })  => {
const caption =`
*༺❁━━═════⊱𓆩☁️𓆪⊰═════━━❁༻*
*تابعني على تطبيق انستاغرام لدعم المطور ومعرفة كل جديد حول بوت شانكس والبوتات بصفة عامة 🏹:*
*┅┅┅┅┅┅┅༻اوامر التنزيلات༺┅┅┅┅┅┅┅*
*┇☁️❯ .فيديو*
*❐↞يجيب لك مقاطع  اليوتيوب باسم المقطع*
*┇🎳❯ .يوتيوب*
*❐↞ينزل لك مقطع من اليوتيوب برابط*

*┇⛩️❯.انستا*
*❐↞ينزل لك ريلز من انستا بواسطة الرابط*

*┇🎡❯.فايس*
*❐↞ينزل لك ريلز من الفايسبوك بواسطة الرابط*

*┇🪔❯.اغنيه*
*❐↞يجيب لك اغنيه الي تطلب*

*┇⛩️❯.تويتر*
*❐↞ينزل لك مقاطع من تويتر*

*┇🌀❯.سبوتيفاي*
*❐↞يجيب لك اغاني من سبوتيفاي برابط الاغنيه*

*┇🍀❯.ميديافاير*
*❐↞ينزل لك الملفات من ميديافاير*

*┇🗞️❯.تطبيق*
*❐↞يحمل لك التطبيقات من بلاي ستور*

*┇🏹❯.ميغا*
*❐↞يحمل لك الملفات من ميغا*

*┇🦄❯.تيك*
*❐↞ينزل لك مقاطع التيك توك بدون علامة مائية*

*┇🗽❯.درايف*
*❐↞ينزل لك الملفات من غوغل درايف*

*┇🔖❯.بينتر*
*❐↞يجيب لك صور من بينترست*
*༺❁━━═════⊱𓆩☁️𓆪⊰═════━━❁༻*
*✠ ~تــ✍︎ــوقــيــع ↯:~*
*『𝐂𝐋𝐎𝐔𝐃𓆩☁️𓆪𝐊𝐈𝐍𝐆𝐃𝐎𝐌』*
  ‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎ info sc owner :
 -----------------------------
  ⌬ | *𝚈𝙾𝚄𝚃𝚄𝙱𝙴*:\قريبا
  ⌬ | *𝙸𝙽𝚂𝚃𝙰𝙶𝚁𝙰𝙼*:https://www.instagram.com/shanks__an?igsh=MWFmc2dmdTllaTE1NA==
  ----------------------------- 
`


await conn.sendMessage( m.chat, {
        video: {
          url: 'https://telegra.ph/file/a2a1de6434ce22177b26b.mp4'
        },
        caption: caption,
        gifPlayback: true,
        gifAttribution: Math.floor( Math.random( ) * 2 ) + 1
      }, {
        quoted: m
      } );
}

handler.help = ['allmenu']
handler.tags = ['main']
handler.command = ['menu'] 
export default handler
