let handler = async (m, { conn, usedPrefix, usedPrefix: _p, __dirname, text, isPrems })  => {
const caption =`
*༺❁━━═════⊱𓆩☁️𓆪⊰═════━━❁༻*
*تابعني على تطبيق انستاغرام لدعم المطور ومعرفة كل جديد حول بوت شانكس والبوتات بصفة عامة 🏹:*
┅┅┅┅┅┅┅༻اوامر التحويلات༺┅┅┅┅┅┅┅
*┇☁️❯ .ملصق*
*❐↞لتحويل الصور والفيديوهات وجيف لملصقات*

*┇🎳❯ .سرقه*
*❐↞لتغيير حقوق الملصق*

*┇⛩️❯.لصوره*
*❐↞لتحويل الملصقات لصور*

*┇🎡❯.لفيديو*
*❐↞لتحويل الملصقات لفيديوهات*

*┇🪔❯.جيف*
*❐↞لتحويل المقاطع لجيف*

*┇⛩️❯.تليجراف*
*❐↞يحول صور أو مقاطع لرابط تلجراف*

*┇🌀❯.لرابط*
*❐↞يحول صور أو المقاطع لرابط مختصر*

*┇🍀❯.لصوت*
*❐↞يحول الفيديوهات لصوت*

*┇🗞️❯.لباركود*
*❐↞يحول أي شي لباركود*

*┇🏹❯.دمج*
*❐↞يدمج الملصقات*

*┇🍥❯.فلتر*
*❐↞يعمل فلتر للصوره ويخليها ملصق*

*┇🍂❯.لملف
*❐↞يحول الصور لpdf*
*༺❁━━═════⊱𓆩☁️𓆪⊰═════━━❁༻*
*✠ ~تــ✍︎ــوقــيــع ↯:~*
*『𝐂𝐋𝐎𝐔𝐃𓆩☁️𓆪𝐊𝐈𝐍𝐆𝐃𝐎𝐌』*
  ‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎ info sc owner :
 -----------------------------
  ⌬ | *𝚈𝙾𝚄𝚃𝚄𝙱𝙴*:\قريبا
  ⌬ | *𝙸𝙽𝚂𝚃𝙰𝙶𝚁𝙰𝙼*:https://www.instagram.com/shanks__an?igsh=MWFmc2dmdTllaTE1NA==
  ----------------------------- 
`


await conn.sendMessage( m.chat, {
        video: {
          url: 'https://telegra.ph/file/a2a1de6434ce22177b26b.mp4'
        },
        caption: caption,
        gifPlayback: true,
        gifAttribution: Math.floor( Math.random( ) * 2 ) + 1
      }, {
        quoted: m
      } );
}

handler.help = ['allmenu']
handler.tags = ['main']
handler.command = ['التحويلات'] 
export default handler
