let handler = async (m, { conn, usedPrefix, usedPrefix: _p, __dirname, text, isPrems })  => {
const caption =`
*༺❁━━═════⊱𓆩☁️𓆪⊰═════━━❁༻*
*تابعني على تطبيق انستاغرام لدعم المطور ومعرفة كل جديد حول بوت شانكس والبوتات بصفة عامة 🏹:*
┅┅┅┅┅┅┅༻اوامر الالعاب༺┅┅┅┅┅┅┅
*┇🍂❯ .احزر*
*❐↞معرفة الشخصية من الصورة*

*┇🎳❯ .عين*
*❐↞معرفة الشخصية من عينها*

*┇🔖❯.كوره*
*❐↞.معرفة لاعبين كرة القدم من الصورة*

*┇🧭❯.دين*
*❐↞أسئلة دينية*

*┇🪄❯.رياضيات*
*❐↞عمليات رياضية*

*┇💠❯.الغاز*
*❐↞الغاز عربية ممتعة*

*┇🇲🇦❯.علم*
*❐↞معرفة الدولة من العلم*

*┇🔰❯.كت*
*❐↞تكتب نفس الي يكتبه البوت*

*┇🎴❯.فكك*
*❐↞تفكك الكلمة الي يرسل البوت*

*┇🔱❯.رتب*
*❐↞ترتب الكلمة الي يرسل البوت*

*┇💮❯.ايموجي*
*❐↞تعرف الشخصية من الايموجي*

*┇⚜️❯.كت2*
*❐↞تكتب نفس الي يكتبه البوت*

*┇♻️❯.هل*
*❐↞للتسليه مع الاصدقاء*

*┇❄️❯.لو*
*❐↞لو خيروك*

*┇⚡❯.فعاليه*
*❐↞فعاليات ممتعة*

*┇⭐❯.سؤال*
*❐↞سؤال عن الانميات*

*┇🍷❯.رهان*
*❐↞تراهن بنقاط البوت*

*┇⚽❯.خمن*
*❐↞تخمن الشخصية من الوصف*

*┇🎯❯.اكس_او*
*❐↞لعبة اكس او*

*┇🧣❯.لعبه*
*❐↞لعبة حجرة ورقة مقص*
*༺❁━━═════⊱𓆩☁️𓆪⊰═════━━❁༻*
*✠ ~تــ✍︎ــوقــيــع ↯:~*
*『𝐂𝐋𝐎𝐔𝐃𓆩☁️𓆪𝐊𝐈𝐍𝐆𝐃𝐎𝐌』*
  ‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎ info sc owner :
 -----------------------------
  ⌬ | *𝚈𝙾𝚄𝚃𝚄𝙱𝙴*:\قريبا
  ⌬ | *𝙸𝙽𝚂𝚃𝙰𝙶𝚁𝙰𝙼*:https://www.instagram.com/shanks__an?igsh=MWFmc2dmdTllaTE1NA==
  ----------------------------- 
`


await conn.sendMessage( m.chat, {
        video: {
          url: 'https://telegra.ph/file/a2a1de6434ce22177b26b.mp4'
        },
        caption: caption,
        gifPlayback: true,
        gifAttribution: Math.floor( Math.random( ) * 2 ) + 1
      }, {
        quoted: m
      } );
}

handler.help = ['allmenu']
handler.tags = ['main']
handler.command = ['العاب'] 
export default handler
