let handler = async (m, { conn, usedPrefix, usedPrefix: _p, __dirname, text, isPrems })  => {
const caption =`
*༺❁━━═════⊱𓆩☁️𓆪⊰═════━━❁༻*
*تابعني على تطبيق انستاغرام لدعم المطور ومعرفة كل جديد حول بوت شانكس والبوتات بصفة عامة 🏹:*
┅┅┅┅┅┅┅༻اوامر الالعاب༺┅┅┅┅┅┅┅
*┇🍂❯ .بروفايل*
*❐↞يرسل لك بروفايلك أو حدا تمنشنو*

*┇🎳❯ .لينك*
*❐↞يرسلك لينك الجروب*

*┇🔖❯.رستر*
*❐↞يعيد تعيين لينك الجروب*

*┇🧭❯.جروب_فتح*
*❐↞يفتح الجروب*

*┇🪄❯.جروب_غلق*
*❐↞يغلق الجروب*

*┇💠❯.رفع*
*❐↞يرفعك لمشرف*

*┇🇲🇦❯.خفض*
*❐↞ينزلك من مشرف*

*┇🔰❯.طرد*
*❐↞يطرد عضو*

*┇🎴❯.انذار*
*❐↞يعطي انذار*

*┇🔱❯.الغاء*
*❐↞يلغي الإنذار*

*┇💮❯.منشن*
*❐↞منشن جماعي*

*┇⚜️❯.مخفي*
*❐↞منشن مخفي*

*┇♻️❯.لمنشن*
*❐↞يحول الرسالة لمنشن*

*┇❄️❯.مشرفين*
*❐↞يمنشن مشرفين*

*┇⚡❯.حذف*
*❐↞يحذف رسالة*

*┇⭐❯.تغيير_بروفايل*
*❐↞يغير بروفايل الجروب*

*┇🍷❯.تغيير_وصف*
*❐↞يغير وصف الجروب*

*┇⚽❯.تغيير_اسم*
*❐↞يغير اسم الجروب*

*┇🎯❯.وصف*
*❐↞يعطيك وصف الجروب*

*┇🧣❯.امبراطور*
*❐↞يجيبل لك رقم مؤسس الجروب🫶🏻*
*༺❁━━═════⊱𓆩☁️𓆪⊰═════━━❁༻*
*✠ ~تــ✍︎ــوقــيــع ↯:~*
*『𝐂𝐋𝐎𝐔𝐃𓆩☁️𓆪𝐊𝐈𝐍𝐆𝐃𝐎𝐌』*
  ‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎ info sc owner :
 -----------------------------
  ⌬ | *𝚈𝙾𝚄𝚃𝚄𝙱𝙴*:\قريبا
  ⌬ | *𝙸𝙽𝚂𝚃𝙰𝙶𝚁𝙰𝙼*:https://www.instagram.com/shanks__an?igsh=MWFmc2dmdTllaTE1NA==
  ----------------------------- 
`


await conn.sendMessage( m.chat, {
        video: {
          url: 'https://telegra.ph/file/a2a1de6434ce22177b26b.mp4'
        },
        caption: caption,
        gifPlayback: true,
        gifAttribution: Math.floor( Math.random( ) * 2 ) + 1
      }, {
        quoted: m
      } );
}

handler.help = ['allmenu']
handler.tags = ['main']
handler.command = ['جروبات'] 
export default handler
